Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: If you start a program using this function and want to leave it running in the background, you have to make sure that the output of that program is redirected to a file or some other output stream or else PHP will hang until the execution of the program ends.
es: Destacar que si usted va a permitir que se pasen datos provenientes de usuarios a esta función, entonces debería usar EscapeShellCmd() para asegurarse de que los usuarios no pueden engañar al sistema para ejecutar instrucciones arbitrarias.

source: See also system(), passthru(), popen(), escapeshellcmd(), and the backtick operator.
es: Véase también system(), PassThru(), popen(), EscapeShellCmd(), y el operador ` (apóstrofe invertido).

source: Example 1. exif_read_data() example
es: Ejemplo 1. exif_read_data() example

source: Example 1. exif_thumbnail() example
es: Ejemplo 1. exif_thumbnail() example

source: Exit statuses should be in the range 1 to 254, the exit status 255 is reserved by PHP and shall not be used.
es: Esta construcción del lenguaje finaliza la ejecución del script.

source: ?php $filename = '/ path / to / data-file'; $file = fopen ($filename, 'r') or exit("unable to open file ($filename)");?
es: No devuelve nada.

source: Returns e raised to the power of arg.
es: Devuelve el número e elevado a la potencia de arg.

source: See also pow().
es: Vea también pow().

source: If limit is set, the returned array will contain a maximum of limit elements with the last element containing the rest of string.
es: Devuelve una matriz de cadenas, cada una de las cuales es una subcadena de cadena formada mediante su división en las fronteras marcadas por la cadena separador.

source: If separator contains a value that is not contained in string, then explode() will return an array containing string.
es: Si se especifica limite, la matriz devuelta contendrá un máximo de limite elementos con el último conteniendo el resto de la cadena.

source: The limit parameter was added in PHP 4.0.1
es: Ejemplo 1.

source: Example 1. explode() examples
es: Ejemplo de explode()

source: Although implode() can for historical reasons accept its parameters in either order, explode() cannot.
es: $pizza = "trozo1 trozo2 trozo3 trozo4 trozo5 trozo6"; $trozos = explode (" ", $pizza);

source: See also preg_split(), spliti(), split(), and implode().
es: Vea también split() e implode().

source: if (!extension_loaded('gd')) {if (!dl('gd.so')) {exit;}}
es: Devuelve TRUE si la extensión identificada por name (nombre) está cargada.

source: $php -m [PHP Modules] xml tokenizer standard sockets session posix pcre overload mysql mbstring ctype [Zend Modules]
es: Puede ver el nombre de varias extensiones utilizando phpinfo().

source: Most internal extension names are written in lower case but there may be extension available which also use uppercase letters.
es: Véase también phpinfo().

source: Be warned that this function compares case sensitive!
es: Nota:

source: See also get_loaded_extensions(), get_extension_funcs(), phpinfo() and dl().
es: Esta función fue añadida en 3.0.10.

source: It takes an associative array var_array and treats keys as variable names and values as variable values.
es: Esta función se utiliza para importar variables desde una matriz a la tabla de símbolos actual.

source: It also checks for collisions with existing variables in the symbol table.
es: La forma de tratar éstas se determina por el tipo_extraccion.

source: It can be one of the following values:
es: Puede tener únicamente uno de los siguientes valores:

source: If there is a collision, don 't overwrite the existing variable.
es: Si hay colisión, sobreescribe la variable existente.

source: Prefix all variable names with prefix.
es: Si hay colisión, no sobreescribas la variable existente.

source: Only prefix invalid / numeric variable names with prefix.
es: Si hay una colisión, añade el prefijo a la nueva variable.

source: Only overwrite the variable if it already exists in the current symbol table, otherwise do nothing.
es: Añade el prefijo a todas las variables.

source: This flag was added in PHP 4.2.0.
es: Si no se especifica tipo_extraccion, se asume que vale EXTR_OVERWRITE.

source: This effectively means that the values of the imported variables are still referencing the values of the var_array parameter.
es: extract() comprueba si cada clave es un nombre válido de variable, y sólo lo importa si lo es.

source: You can use this flag on its own or combine it with any other flag by OR 'ing the extract_type.
es: Nota:

source: This flag was added in PHP 4.3.0.
es: N.T.:

source: Note that prefix is only required if extract_type is EXTR_PREFIX_SAME, EXTR_PREFIX_ALL, EXTR_PREFIX_INVALID or EXTR_PREFIX_IF_EXISTS.
es: En el caso español, no valdría "año" como nombre variable (pero sí como clave en una matriz cualquiera).

source: extract() returns the number of variables successfully imported into the symbol table.
es: Un uso posible para extract sería importar en la tabla de símbolos las variables contenidas en la matriz asociativa que devuelve wddx_deserialize().

source: A possible use for extract() is to import into the symbol table variables contained in an associative array returned by wddx_deserialize().
es: Ejemplo de extract()

source: ?php / * Suppose that $var_array is an array returned from wddx_deserialize * / $size = "large"; $var_array = array ("color" = "blue", "size "= "medium", "shape" = "sphere"); extract ($var_array, EXTR_PREFIX_SAME, "wddx"); print "$color, $size, $shape, $wddx_size\n";?
es: php? / * Suponemos que $matriz_var es una matriz devuelta por wddx_deserialize * / $tamano = "grande"; $matriz_var = array ("color" = "azul", "tamano "= "media", "forma" = "esfera"); extract ($matriz_var, EXTR_PREFIX_SAME, "wddx"); print "$color, $tamano, $forma, $wddx_tamano\n";?

source: The above example will produce:
es: El programa anterior producirá:

source: blue, large, sphere, medium
es: azul, grande, esfera, media

source: If EXTR_SKIP was specified, then $wddx_size wouldn 't even have been created.
es: La variable $tamano no fue sobreescrita porque especificamos EXTR_PREFIX_SAME, que provocó la creación de $wddx_tamano.

source: EXTR_OVERWRITE would have caused $size to have value "medium", and EXTR_PREFIX_ALL would result in new variables being named $wddx_color, $wddx_size, and $wddx_shape.
es: Si se hubiera especificado EXTR_SKIP, $wddx_tamano ni siquiera habría sido creada.

source: See also compact().
es: EXTR_OVERWRITE habría provocado que $tamano tuviera el valor "media", y EXTR_PREFIX_ALL habría provocado que aparecieran nuevas variables llamadas $wddx_color, $wddx_tamano, y $wddx_forma.

source: Example 1. fbsql_close() example
es: Ejemplo 1. fbsql_close() example

source: Example 1. fbsql_connect() example
es: Ejemplo 1. fbsql_connect() example

source: Example 1. fbsql_create_blob() example
es: Ejemplo 1. fbsql_create_blob() example

source: Example 1. fbsql_create_clob() example
es: Ejemplo 1. fbsql_create_clob() example

source: Example 1. fbsql_create_db() example
es: Ejemplo 1. fbsql_create_db() example

source: Example 1. fbsql_data_seek() example
es: Ejemplo 1. fbsql_data_seek() example

source: Example 1. fbsql_fetch_array() example
es: Ejemplo 1. fbsql_fetch_array() example

source: Example 1. fbsql_fetch_assoc() example
es: Ejemplo 1. fbsql_fetch_assoc() example

source: Example 1. fbsql_fetch_field() example
es: Ejemplo 1. fbsql_fetch_field() example

source: Example 1. fbsql_fetch_object() example
es: Ejemplo 1. fbsql_fetch_object() example

source: Example 1. fbsql_field_name() example
es: Ejemplo 1. fbsql_field_name() example

source: Example 1. fbsql_field_type() example
es: Ejemplo 1. fbsql_field_type() example

source: Example 1. fbsql_list_dbs() example
es: Ejemplo 1. fbsql_list_dbs() example

source: Example 1. fbsql_list_fields() example
es: Ejemplo 1. fbsql_list_fields() example

source: Example 1. fbsql_next_result() example
es: Ejemplo 1. fbsql_next_result() example

source: Example 1. fbsql_num_rows() example
es: Ejemplo 1. fbsql_num_rows() example

source: Example 1. fbsql_query() example
es: Ejemplo 1. fbsql_query() example

source: Example 2. fbsql_query() example
es: Ejemplo 2. fbsql_query() example

source: Example 1. fbsql_read_blob() example
es: Ejemplo 1. fbsql_read_blob() example

source: Example 1. fbsql_read_clob() example
es: Ejemplo 1. fbsql_read_clob() example

source: Example 1. fbsql_tablename() example
es: Ejemplo 1. fbsql_tablename() example

source: filePro functions
es: Funciones filePro

source: ?php $handle = fopen( 'somefile.txt', 'r'); fclose($handle);?
es: El apuntador al fichero debe ser válido y debe apuntarse a un fichero abierto con éxito con fopen() o con fsockopen().

source: The fdf_close() function closes the FDF document.
es: La función fdf_close() cierra un documento FDF.

source: See also fdf_open().
es: Vea también fdf_open().

source: The fdf_create() creates a new FDF document.
es: La función fdf_create() crea un documento FDF nuevo.

source: This function is needed if one would like to populate input fields in a PDF document with data.
es: Esta función se necesita si se desea rellenar los campos de entrada en un documento PDF.

source: Populating a PDF document
es: Rellenando un documento PDF

source: ?php $outfdf = fdf_create(); fdf_set_value($outfdf, "volume", $volume, 0); fdf_set_file($outfdf, "http: / testfdf / resultlabel.pdf"); fdf_save($outfdf, "outtest.fdf"); fdf_close($outfdf); Header("Content-type: application / vnd.fdf"); $fp = fopen("outtest.fdf", "r"); fpassthru($fp); unlink("outtest.fdf");?
es: ?php $outfdf = fdf_create(); fdf_set_value($outfdf, "volumen", $volume, 0); fdf_set_file($outfdf, "http: / testfdf / resultlabel.pdf"); fdf_save($outfdf, "outtest.fdf"); fdf_close($outfdf); Header("Content-type: application / vnd.fdf"); $fp = fopen("outtest.fdf", "r"); fpassthru($fp); unlink("outtest.fdf");?

source: See also fdf_close(), fdf_save(), fdf_open().
es: Vea también fdf_close(), fdf_save(), fdf_open().

source: The fdf_set_file() returns the value of the / F key.
es: La función fdf_set_file() devuelve el valor de la clave / F.

source: See also fdf_set_file().
es: Vea también fdf_set_file().

source: The fdf_get_status() returns the value of the / STATUS key.
es: La función fdf_get_status() devuelve el valor de la clave / STATUS.

source: See also fdf_set_status().
es: Vea también fdf_set_status().

source: For non-array fields the optional parameter which will be ignored.
es: La función fdf_get_value() devuelve el valor de un campo.

source: See also fdf_set_value().
es: Vea también fdf_set_value().

source: See also fdf_enum_fields() and fdf_get_value().
es: Vea también fdf_set_field(), fdf_get_field().

source: The fdf_open() function opens a file with form data.
es: La función fdf_open() abre un archivo con datos de formulario.

source: This file must contain the data as returned from a PDF form or created using fdf_create() and fdf_save().
es: Este archivo debe contener los datos tal y como se devuelven en un formulario PDF.

source: You can process the results of a PDF form POST request by writing the data recieved in $HTTP_FDF_DATA to a file and open it using fdf_open().
es: Actualmente dicho archivo debe crearse "manualmente" usando la función fopen() y escribiendo en éste el contenido de HTTP_FDF_DATA usando fwrite().

source: Starting with PHP 4.3 you can also use fdf_open_string() which handles temporary file creation and cleanup for you.
es: No existe un mecanismo similar al de los formularios HTML donde se crea una variable para cada campo de entrada.

source: Accessing the form data
es: Accediendo a los datos del formulario

source: ?php / / Save the FDF data into a temp file $fdffp = fopen( "test.fdf", "w"); fwrite($fdffp, $HTTP_FDF_DATA, strlen($HTTP_FDF_DATA)); fclose($fdffp); / / Open temp file and evaluate data $fdf = fdf_open("test.fdf");... fdf_close($fdf);?
es: ?php / / Guarda los datos FDF en un archivo temporal $fdffp = fopen( "test.fdf", "w"); fwrite($fdffp, $HTTP_FDF_DATA, strlen($HTTP_FDF_DATA)); fclose($fdffp); / / Abre archivo temporal y evalúa los datos $fdf = fdf_open("test.fdf");... fdf_close($fdf);?

source: See also fdf_open_string(), fdf_close(), fdf_create() and fdf_save().
es: Vea también fdf_close().

source: The fdf_save() function saves a FDF document.
es: La función fdf_save() guarda un documento FDF.

source: The resulting FDF will be written to filename.
es: El kit de FDF proporciona una forma de volcar el documento a stdout si el parámetro filename es '. '.

source: Without a filename fdf_save() will write the FDF to the default PHP output stream.
es: En tal caso se deberá escribir a un fichero y utilizar p. ej. fpassthru() para visualizarlo.

source: See also fdf_save_string(), fdf_create() and fdf_close().
es: Vea también fdf_close() y el ejemplo para fdf_create().

source: The fdf_set_ap() function sets the appearance of a field (i.e. the value of the / AP key).
es: La función fdf_set_ap() ajusta la apariencia de un campo (p. ej. el valor de la clave / AP).

source: The possible values of face are FDFNormalAP, FDFRolloverAP and FDFDownAP.
es: Los valores posibles de face son 1=FDFNormalAP, 2=FDFRolloverAP, 3=FDFDownAP.

source: The fdf_set_file() selects a different PDF document to display the form results in then the form it originated from.
es: La función fdf_set_file() fija el valor de la clave / F.

source: The frame to display the document in may be selected using the optional parameter target_frame or the function fdf_set_target_frame().
es: La clave / F es simplemente una referencia a un formulario PDF que se va a rellenar con datos.

source: Passing FDF data to a second form
es: En un entorno web es un URL (p.ej. http: / testfdf / resultlabel.pdf).

source: See also fdf_get_file() and fdf_set_target_frame().
es: Vea también fdf_get_file() y el ejemplo para fdf_create().

source: When a client recieves a FDF with a status set it will present the value in an alert box.
es: La función fdf_set_status() fija el valor de la clave / STATUS.

source: See also fdf_get_status().
es: Vea también fdf_get_status().

source: In this case all array elements will be stored as a value array.
es: La función fdf_set_value() fija el valor de un campo.

source: The value is no longer used in the current toolkit version 5.0.
es: El parámetro final determina si el valor del campo se deberá convertir a un Nombre PDF (isName = 1) o convertir en una Cadena PDF (isName = 0).

source: Support for value arrays was added in PHP 4.3.
es: Vea también fdf_get_value().

source: Returns TRUE if the file pointer is at EOF or an error occurs; otherwise returns FALSE.
es: Devuelve TRUE si el apuntador del fichero está en EOF o si ocurre un error; en otro caso devuelve FALSE.

source: The file pointer must be valid, and must point to a file successfully opened by fopen(), popen(), or fsockopen().
es: The file pointer must be valid, and must point to a file El apuntador al fichero debe ser válido, y debe apuntar a un fichero abierto con éxito por fopen(), popen(), o fsockopen().

source: Returns a string containing a single character read from the file pointed to by handle.
es: Devuelve una cadena (string) conteniendo un simple caracter leido del fichero apuntado por fp.

source: Returns FALSE on EOF.
es: Devuelve FALSE para EOF (como hace feof()).

source: See also fread(), fopen(), popen(), fsockopen(), and fgets().
es: Ver también fread(), fopen(), popen(), fsockopen(), y fgets().

source: Similar to fgets() except that fgetcsv() parses the line it reads for fields in CSV format and returns an array containing the fields read.
es: Parecida a fgets() excepto que fgetcsv() parsea la línea que lee buscando campos en formato CSV y devuelve un array conteniendo los campos leidos.

source: The optional enclosure cannot be null, and is limited to one character.
es: El delimitador de campo es una coma, a menos que se especifique otro delimitador con el tercer parámetro opcional.

source: The handle parameter must be a valid file pointer to a file successfully opened by fopen(), popen(), or fsockopen().
es: la longitud debe ser mayor que la línea más larga que pueda encontrarse en le fichero CSV (permitiendo arrastrar caracteres de fin de línea)

source: The length parameter must be greater than the longest line to be found in the CSV file (allowing for trailing line-end characters).
es: fgetcsv() devuelve FALSE en caso de error, incluyendo el fin de fichero.

source: fgetcsv() returns FALSE on error, including end of file.
es: NOTA:

source: A blank line in a CSV file will be returned as an array comprising a single null field, and will not be treated as an error.
es: Una línea en blanco en un fichero CSV se devuelve como un array que contiene un único campo nulo, y esto no será tratado como un error.

source: Read and print the entire contents of a CSV file
es: Ejemplo de fgetcsv() - Leer e imprimir el contenido completo de un fichero CSV

source: See also explode(), file(), and pack()
es: $row = 1; $fp = fopen ("test.csv" ,"r"); while ($data = fgetcsv ($fp, 1000, ",")) {$num = count ($data); print" p $num fields in line $row: br "; $row++; for ($c=0; $c $num; $c++) {print $data[$c]." br ";}} fclose ($fp);

source: If no length is specified, the length defaults to 1k, or 1024 bytes.
es: Devuelve una cadena de como mucho length - 1 bytes leidos del fichero apuntado por fp.

source: Reading a file line by line
es: Fallos Comunes:

source: As of PHP 4.3, omitting length will keep reading from the stream until it reaches the end of the line.
es: El apuntador al fichero debe ser válido, y debe apuntar a un fichero abierto con éxito con fopen(), popen(), o fsockopen().

source: If the majority of the lines in the file are all larger than 8KB, it is more resource efficient for your script to specify the maximum line length.
es: A continuación un ejemplo sencillo:

source: This function is binary safe as of PHP 4.3.
es: Ejemplo 1.

source: If you are having problems with PHP not recognizing the line endings when reading files either on or created by a Macintosh computer, you might want to enable the auto_detect_line_endings run-time configuration option.
es: $fd = fopen ("/ tmp / inputfile.txt", "r"); while (!feof($fd)) {$buffer = fgets($fd, 4096); echo $buffer;} fclose ($fd);

source: See also fread(), fopen(), popen(), fgetc(), fsockopen(), and socket_set_timeout().
es: Ver también fread(), fopen(), popen(), fgetc(), y fsockopen().

source: You can use the optional third parameter to specify tags which should not be stripped.
es: Idéntica a fgets(), excepto que fgetss trata de quitar cualquier etiqueta HTML y PHP del texto que lee.

source: See also fgets(), fopen(), fsockopen(), popen(), and strip_tags().
es: Ver también fgets(), fopen(), fsockopen(), popen(), y strip_tags().

source: This can be costly performancewise when an application regularly accesses a very large number of files or directories.
es: Devuelve la fecha a la que el fichero fue accedido por última vez, o FALSE en caso de error.

source: Some Unix filesystems can be mounted with atime updates disabled to increase the performance of such applications; USENET news spools are a common example.
es: Los resultados de esta función son cacheados.

source: See also filemtime() (which is what you want to use when you want to create "Last Modified "footers on web pages) and fileatime().
es: Devuelve el momento en el que el fichero fue cambiado por última vez, o FALSE en caso de error.

source: This is wrong.
es: Los resultados de esta función son cacheados.

source: The results of this function are cached.
es: Devuelve TRUE si el fichero especificado por filename existe; y FALSE en otro caso.

source: On windows, use / /computername / share / filename or \\\\computername\share\filename to check files on network shares.
es: El resultado de esta función es cacheado.

source: See also is_readable(), is_writable(), is_file() and file().
es: Ver clearstatcache() para más detalles.

source: This function is binary-safe.
es: Esta función es segura bináriamente.

source: The group ID is returned in numerical format, use posix_getgrgid() to resolve it to a group name.
es: Devuelve el identificador (ID) de grupo del propietario del fichero, o FALSE en caso de un error.

source: See clearstatcache() for more details.
es: El ID del grupo es devuelto en formato numérico, usar posix_getgrgid() para obtener el nombre del grupo.

source: In PHP 4.3.0 file() became binary safe.
es: Cada elemento del array corresponde a una línea del fichero, con el caracter de nueva línea incluido.

source: See fopen() for more details on how to specify the filename and Appendix I for a list of supported URL protocols.
es: Se puede utilizar el segundo parámetro opcional y ponerle el valor "1", si también se quiere buscar el fichero en el include_path.

source: See also readfile(), fopen(), fsockopen(), popen(), file_get_contents(), and include().
es: Ver también readfile(), fopen(), y popen().

source: Returns the inode number of the file, or FALSE in case of an error.
es: Devuelve el número de inode del fichero, o FALSE en caso de un error.

source: This function will not work on remote files; the file to be examined must be accessible via the server's filesystem.
es: Devuelve el momento en el que el fichero fue modificado por última vez, o FALSE en caso de un error.

source: Example 1. filemtime() example
es: Los resultados de esta función son cacheados.

source: See also filectime(), stat(), touch(), and getlastmod().
es: Ver clearstatcache() para más detalles.

source: Returns the user ID of the owner of the file, or FALSE in case of an error.
es: Devuelve el identificador (ID) de usuario del propietario del fichero, o FALSE en caso de error.

source: Returns the permissions on the file, or FALSE in case of an error.
es: Devuelve los permisos del fichero, o FALSE en caso de error.

source: Returns the number of fields (columns) in the opened filePro database.
es: Devuelve el numero de campos (columnas) existentes en la base de datos filePro abierta.

source: See also filepro().
es: Ver tambien filepro().

source: Returns the name of the field corresponding to field_number.
es: Devuelve el nombre del campo correspondiente a field_number.

source: Returns the edit type of the field corresponding to field_number.
es: Devuelve el tipo de campo del campo correspondiente a field_number.

source: Returns the width of the field corresponding to field_number.
es: Devuelve la anchura de el campo correspondiente a field_number.

source: No locking is done, so you should avoid modifying your filePro database while it may be opened in PHP.
es: Lee y verifica el fichero de mapeo, guardando la relacion de campos e informacion.

source: Returns the size of the file in bytes, or FALSE in case of an error.
es: Devuelve el tamaño del fichero, o FALSE en caso de error.

source: Possible values are fifo, char, dir, block, link, file, and unknown.
es: Devuelve el tipo de fichero.

source: Returns FALSE if an error occurs. filetype() will also produce an E_NOTICE message if the stat call fails or if the file type is unknown.
es: Valores posibles son fifo, char, dir, block, link, file, y unknown.

source: See also: is_dir(), is_file(), is_link(), file_exists(), and stat().
es: Ver clearstatcache() para más detalles.

source: To acquire a shared lock (reader), set operation to LOCK_SH (set to 1 prior to PHP 4.0.1).
es: PHP soporta un método portable de bloquear ficheros completos de manera asesorada (lo que significa que todos los programas que acceden tienen que usar el mismo modo de bloqueo o éste no funcionará).
